using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using UnityEngine.UI;

public class MouseClick : MonoBehaviour
{

    public Text myText;
    public GameObject panel;

    private void Start()
    {
        myText.enabled = false;
        panel.SetActive(false);
    }

    void Update()
    {
        bool pressedMercury = Input.GetKey(KeyCode.Alpha1);
        bool pressedVenus = Input.GetKey(KeyCode.Alpha2);
        bool pressedEarth = Input.GetKey(KeyCode.Alpha3);
        bool pressedMoon = Input.GetKey(KeyCode.Alpha4);
        bool pressedMars = Input.GetKey(KeyCode.Alpha5);
        bool pressedJupiter = Input.GetKey(KeyCode.Alpha6);
        bool pressedSaturn = Input.GetKey(KeyCode.Alpha7);
        bool pressedUranus = Input.GetKey(KeyCode.Alpha8);
        bool pressedNeptunus = Input.GetKey(KeyCode.Alpha9);
        bool pressedNull = Input.GetKey(KeyCode.Alpha0);
      
        if (pressedMercury) {
            myText.enabled = true;
            panel.SetActive(true);
            myText.text = "Меркурій  — найближча до Сонця планета Сонячної системи. " +
                "Обертається навколо Сонця за 87,969 земних діб. Меркурій належить до " +
                "внутрішніх планет, оскільки його орбіта лежить ближче до Сонця, ніж пояс " +
                "астероїдів. Після позбавлення Плутона статусу планети Меркурій є найменшою " +
                "планетою Сонячної системи. ";
            
        }
        if (pressedVenus)
        {
            myText.enabled = true;
            panel.SetActive(true);
            myText.text = "Венера — друга планета Сонячної системи. " +
                "Період обертання навколо Сонця — 224,7 земних діб. " +
                "За розміром майже така сама, як Земля. " +
                "Венера — третій за яскравістю об'єкт на небі; її блиск " +
                "поступається лише блиску Сонця та Місяця. Належить до планет, " +
                "відомих людству з найдавніших часів. ";
        }
        if (pressedEarth)
        {
            myText.enabled = true;
            panel.SetActive(true);
            myText.text = "Земля — третя від Сонця планета Сонячної системи, " +
                "єдина планета, на якій відоме життя, домівка людства. " +
                "Земля належить до планет земної групи і є найбільшою з цих планет " +
                "у Сонячній системі. Середній радіус - 6371,3 км. " +
                "Середня відстань від Сонця становить 150 млн км";
        }
        if (pressedMoon)
        {
            myText.enabled = true;
            panel.SetActive(true);
            myText.text = "Місяць — єдиний природний супутник планети Земля. " +
                "Другий за яскравістю об'єкт на земному небосхилі після Сонця і " +
                "п'ятий за величиною супутник планет Сонячної системи. Станом на " +
                "2018 перший і єдиний позаземний об'єкт природного походження, на " +
                "якому побувала людина. Середня відстань між центрами Землі і Місяця " +
                "— 384 400 км";
        }
        if (pressedMars)
        {
            myText.enabled = true;
            panel.SetActive(true);
            myText.text = "Марс — четверта планета Сонячної системи за відстанню від Сонця " +
                "й сьома за розміром і масою. Іноді Марс називають «червоною планетою» " +
                "через червонуватий колір поверхні. Марс — планета земного типу з розрідженою " +
                "атмосферою. На Марсі є метеоритні кратери, вулкани, долини " +
                "і пустелі, подібні до земних. Загальна площа поверхні Марса " +
                "приблизно дорівнює всій площі Земної суші.";
        }
        if (pressedJupiter)
        {
            myText.enabled = true;
            panel.SetActive(true);
            myText.text = "Юпітер — п'ята та найбільша планета Сонячної системи. " +
                "Середня відстань Юпітера від 778 млн км. Юпітер більш ніж удвічі " +
                "масивніший за всі інші планети разом узяті; він майже в 318 разів " +
                "масивніший за Землю. Маса Юпітера недостатня, " +
                "аби перетворитися на зорю. Юпітер має 79 супутників, " +
                "найбільші з яких — Іо, Європа, Ганімед і Каллісто.";
        }
        if (pressedSaturn)
        {
            myText.enabled = true;
            panel.SetActive(true);
            myText.text = "Сатурн — шоста за віддаленістю від Сонця та друга за " +
                "розмірами планета Сонячної системи. Сатурн швидко обертається навколо " +
                "своєї осі (з періодом — 10,23 години), складається переважно з рідкого " +
                "водню і гелію, має товстий шар атмосфери. Навколо Сонця Сатурн обертається " +
                "за 29,46 земних років на середній відстані 1427 млн км. Його маса у 95 " +
                "разів більша за масу Землі, магнітне поле трохи слабше за земне. ";
        }
        if (pressedUranus)
        {
            myText.enabled = true;
            panel.SetActive(true);
            myText.text = "Уран — сьома від Сонця велика планета Сонячної системи. Діаметр " +
                "Урана в 4 рази, а його маса — в 14.5 разів більші за земні, що робить його" +
                " третьою за діаметром та четвертою за масою планетою Сонячної системи. " +
                "Навколо нього обертаються 27 супутників. Середня відстань від Сонця у 19 " +
                "разів більша, ніж у Землі, і становить 2871 млн км. Один оберт навколо Сонця " +
                "Уран здійснює за 84,01 земного року.";
        }
        if (pressedNeptunus)
        {
            myText.enabled = true;
            panel.SetActive(true);
            myText.text = "Нептун — восьма за віддаленістю від Сонця планета Сонячної системи." +
                " Вона четверта за розміром, третя за масою і належить до планет-гігантів." +
                " Маса Нептуна у 17,2 рази, а діаметр екватора у 3,9 рази більший за земний." +
                " Його середня відстань від Сонця у 30 разів більша, ніж у Землі, і становить" +
                " приблизно 4497 млн км.  Власне обертання настільки швидке, що доба на " +
                "Нептуні триває всього 16 годин.";
        }
        if (pressedNull)
        {
            myText.enabled = false;
            panel.SetActive(false);
        }

    }
}
